
[
  {
    "name": "Programming & AI",
    "description": "Dive into algorithms, machine learning, and advanced coding concepts. Test your knowledge in Python, C++, and AI frameworks.",
    "styleClass": "topic-programming"
  },
  {
    "name": "Biology & Genetics",
    "description": "Explore the mysteries of life, from cellular structures to advanced genetic engineering and ecosystems. Test your biological insights.",
    "styleClass": "topic-biology"
  },
  {
    "name": "Cosmology & Space",
    "description": "Journey through the cosmos, studying black holes, distant galaxies, and the origins of the universe. Explore cosmic phenomena.",
    "styleClass": "topic-space"
  },
  {
    "name": "Robotics & Automation",
    "description": "Delve into the world of smart machines, automation principles, and future technological advancements. Design and control robotic systems.",
    "styleClass": "topic-robotics"
  },
  {
    "name": "Business & Finance",
    "description": "Master economic theories, market trends, and strategic business management. Analyze financial data and investment strategies.",
    "styleClass": "topic-finance"
  },
  {
    "name": "Arts & Culture",
    "description": "Explore art history, diverse cultural movements, and creative expressions across different civilizations. Uncover artistic legacies.",
    "styleClass": "topic-arts"
  },
  {
    "name": "Medicine & Health",
    "description": "Understand human anatomy, physiology, and modern medical practices. Explore diseases, treatments, and public health initiatives.",
    "styleClass": "topic-medicine"
  },
  {
    "name": "Environment & Ecology",
    "description": "Learn about environmental science, climate change, and sustainable practices. Protect our planet and its biodiversity.",
    "styleClass": "topic-ecology"
  },
  {
    "name": "Logic & Philosophy",
    "description": "Challenge your mind with logical puzzles, critical thinking, and philosophical debates. Understand fundamental questions.",
    "styleClass": "topic-philosophy"
  }
]
